perf-test/results/01-run3-jmeter.log
2026-08-18 13:16:00,900 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-18 13:16:00,910 INFO o.a.j.JMeter: Loading user properties from: D:\tools\apache-jmeter-5.6.3\bin\user.properties
2026-08-18 13:16:00,911 INFO o.a.j.JMeter: Loading system properties from: D:\tools\apache-jmeter-5.6.3\bin\system.properties
2026-08-18 13:16:00,913 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-18 13:16:00,913 INFO o.a.j.JMeter: Version 5.6.3
2026-08-18 13:16:00,914 INFO o.a.j.JMeter: java.version=21.0.10
2026-08-18 13:16:00,914 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-18 13:16:00,914 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-18 13:16:00,914 INFO o.a.j.JMeter: os.arch=amd64
2026-08-18 13:16:00,915 INFO o.a.j.JMeter: os.version=10.0
2026-08-18 13:16:00,915 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-18 13:16:00,915 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-18 13:16:00,915 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-18 13:16:00,915 INFO o.a.j.JMeter: Available Processors =24
2026-08-18 13:16:00,920 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-18 13:16:00,920 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-18 13:16:00,920 INFO o.a.j.JMeter: JMeterHome=D:\tools\apache-jmeter-5.6.3
2026-08-18 13:16:00,920 INFO o.a.j.JMeter: user.dir  =D:\sm-console\perf-test
2026-08-18 13:16:00,920 INFO o.a.j.JMeter: PWD       =D:\sm-console\perf-test
2026-08-18 13:16:05,865 INFO o.a.j.JMeter: IP: 192.168.56.1 Name: ICT02-15 FullName: ICT02-15
2026-08-18 13:16:05,872 INFO o.a.j.s.FileServer: Default base='D:\sm-console\perf-test'
2026-08-18 13:16:05,872 INFO o.a.j.s.FileServer: Set new base='D:\sm-console\perf-test'
2026-08-18 13:16:05,979 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-18 13:16:05,998 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-18 13:16:06,000 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-18 13:16:06,002 INFO o.a.j.s.SaveService: Loading file: 01-optimistic-lock.jmx
2026-08-18 13:16:06,036 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:16:06,036 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:16:06,036 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:16:06,036 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:16:06,036 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-18 13:16:06,037 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-18 13:16:06,059 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-18 13:16:06,072 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-18 13:16:06,073 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 13:16:06,073 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 13:16:06,075 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-18 13:16:06,075 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-18 13:16:06,138 INFO o.a.j.JMeter: Running test (1787026566138)
2026-08-18 13:16:06,148 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 5 Admins - Same Inquiry, Same Version
2026-08-18 13:16:06,150 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group 5 Admins - Same Inquiry, Same Version.
2026-08-18 13:16:06,150 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-18 13:16:06,150 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2026-08-18 13:16:06,156 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-18 13:16:06,156 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-18 13:16:06,164 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:16:06,164 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:16:06,164 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:16:06,164 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:16:06,164 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:16:06,165 INFO o.a.j.s.FileServer: Stored: data/admins.csv
2026-08-18 13:16:06,180 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ICT02-15
2026-08-18 13:16:06,184 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-18 13:16:06,185 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-18 13:16:06,185 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-18 13:16:06,185 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-18 13:16:06,185 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:16:06,356 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:16:06,357 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:16:06,357 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:16:06,357 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:16:06,357 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-18 13:16:06,357 INFO o.a.j.s.FileServer: Close: data/admins.csv
2026-08-18 13:16:06,358 INFO o.a.j.r.Summariser: summary =     10 in 00:00:00 =   45.5/s Avg:    63 Min:    38 Max:    89 Err:     4 (40.00%)